In [3]:
import numpy as np
import pandas as pd

In [4]:
## Series In Pandas

In [5]:
label = ['a','b','c']
arr=np.array([1,2,3])
my_list = [3,'a',5]
my_dict = {1:10,2:20,3:30}

In [6]:
pd.Series([100,200,300])

0    100
1    200
2    300
dtype: int64

In [7]:
pd.Series(arr,label)

a    1
b    2
c    3
dtype: int64

In [8]:
pd.Series(arr,my_list)

3    1
a    2
5    3
dtype: int64

In [9]:
pd.Series(my_list,label)

a    3
b    a
c    5
dtype: object

In [10]:
pd.Series(my_dict)

1    10
2    20
3    30
dtype: int64

In [11]:
## Data Frames in Pandas

In [12]:
## ---> this is how we can create the Data Frames in the Pandas

In [13]:
data={
    "name":["Arpit","Aman","Gouri","Sia"],
    "Age":[19,17,15,12],
    "Score":[95,85,75,100]
}

In [14]:
pd.DataFrame(data)

    name  Age  Score
0  Arpit   19     95
1   Aman   17     85
2  Gouri   15     75
3    Sia   12    100

In [15]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
pd.DataFrame(data_list)

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [16]:
col = ["Name","Age","Location","Salary"]
df=pd.DataFrame(data_list,columns=col)
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [17]:
##---->How to Select a paticular col from the dataframe

In [18]:
df["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [19]:
df[["Name","Location"]]

    Name  Location
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [20]:
## ---> Creating a new col

In [21]:
df["Role"] = ["Doc","Eng","teacher","Doc"]

In [22]:
df

    Name  Age  Location  Salary     Role
0   John   28  New York   65000      Doc
1   Anna   34     Paris   70000      Eng
2  Peter   29    Berlin   62000  teacher
3  Linda   42    London   85000      Doc

In [23]:
few_info=df[["Name","Salary","Role"]]

In [24]:
few_info

    Name  Salary     Role
0   John   65000      Doc
1   Anna   70000      Eng
2  Peter   62000  teacher
3  Linda   85000      Doc

In [25]:
## Deleting col

In [26]:
df

    Name  Age  Location  Salary     Role
0   John   28  New York   65000      Doc
1   Anna   34     Paris   70000      Eng
2  Peter   29    Berlin   62000  teacher
3  Linda   42    London   85000      Doc

In [27]:
df.drop("Role",axis=1)

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [28]:
df

    Name  Age  Location  Salary     Role
0   John   28  New York   65000      Doc
1   Anna   34     Paris   70000      Eng
2  Peter   29    Berlin   62000  teacher
3  Linda   42    London   85000      Doc

In [29]:
## So to remove the Role from the memory we can use the inplace

In [30]:
df.drop("Role",axis=1,inplace=True)

In [31]:
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [32]:
## Deleting the row

In [33]:
df.drop(2,axis=0)

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
3  Linda   42    London   85000

In [35]:
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [46]:
## we can use inplace to delete it from the memory

In [47]:
## axis =0 is used for "X" means row 
## axis = 1 is used for "Y" means col

In [ ]:
# For selecting the row

In [36]:
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [37]:
df.loc[0]

Name            John
Age               28
Location    New York
Salary         65000
Name: 0, dtype: object

In [38]:
df.loc[[0,1]]

   Name  Age  Location  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [40]:
df[["Name","Salary"]]   #for coloumn

    Name  Salary
0   John   65000
1   Anna   70000
2  Peter   62000
3  Linda   85000

In [41]:
## how to select the subset of of both row and col

In [42]:
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [43]:
## for example i want 0,1 row location and Salary which is New York 65000  and paris 70000

In [45]:
df.loc[[0,1]][["Location","Salary"]]

   Location  Salary
0  New York   65000
1     Paris   70000

In [46]:
## Conditional Statement

In [47]:
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [48]:
# I want people  whoes age is above 30

In [50]:
df[df["Age"]>30]

    Name  Age Location  Salary
1   Anna   34    Paris   70000
3  Linda   42   London   85000

In [51]:
# I want people  whoes age is above 30 and location Paris

In [53]:
df[(df["Age"]>30) & (df["Location"]=="Paris")]

   Name  Age Location  Salary
1  Anna   34    Paris   70000

In [54]:
## Finding the missing data

In [55]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df = pd.DataFrame(data)

In [56]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [57]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [58]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [59]:
df.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

In [61]:
## Removing the null data

In [ ]:
# we can drop the row of null values

In [62]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [63]:
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [65]:
df.dropna(thresh=3) # thresh means atleast kitna not null value hona chaihiye ek row mein

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

In [66]:
## fill the null field

In [69]:
df.fillna(0 )

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [70]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [71]:
## you can see my dataset is same from starting because i didn't used the inplace=True

In [72]:
value = {"A":200,"B":100,"C":-5,"D":500}

In [73]:
df.fillna(value=value)

       A  B    C      D
0    1.0  1  1.0    1.0
1    2.0  2  2.0  500.0
2  200.0  3  3.0  500.0
3    4.0  4 -5.0  500.0
4    5.0  5 -5.0    5.0